<template>
  <div class="pt-12 container mx-auto px-4">
    <h2 class="text-2xl">
      使い方ページ
    </h2>
    <div class="mt-8">
      <ul>
        <li v-for="(instruction, index) in instructions" :key="index">
          <ObjectAccordion
            :text="instruction.text"
            :title="instruction.title"
          />
        </li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      instructions: [
        {
          title: "① 名刺テンプレートを作成する",
          text:
            "トップページに４つの名刺のテンプレートがあります。テンプレートごとにプロフィール情報の配置場所が異なっています。決まったら、「この名刺を選択する」をクリックしてください。",
        },
        {
          title: "② デザインを選択する",
          text:
            "テンプレートを選択すると、デザインが一覧で表示されます。デザインは、使用されている色の変更が出来るものと出来ないものがあります。デザインカードを１つ選択し、「入力を始める」ボタンをクリックしてください。",
        },
        {
          title: "③ プロフィール情報を入力する",
          text:
            "フォームの上にあるステップバーで今どこまで登録しているかを確認できます。入力内容はページを遷移しても保存されています。入力する情報は、ご自分の名刺に記載したい情報を入力してください。テキストの配置位置は変更できません。",
        },
        {
          title: "④ プレビューで確認する",
          text:
            "フォーム下部の「プレビューボタン」をクリックすると、フォームの入力結果が確認できます。全ての名刺は、テキストカラーの変更、背景への画像の適用が可能です。また、画像の明るさを調節することもできます。「カラー変更可」のデザインの場合は、デザインに使用されているカラーも変更できます。",
        },
        {
          title: "⑤  完成したデザインの確認",
          text:
            "会社情報まで情報を入力し、「次へ」ボタンを押すと、フォームの入力は完了です。デザインと入力した情報が合っているかを確認してください。",
        },
        {
          title: "⑥  ダウンロードする",
          text:
            "ダウンロードが完了すると、output.png という名前で名刺画像がダウンロードされます。",
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped></style>
